In [1]:
import pandas as pd

In [2]:
counts = pd.Series([23,434,12,45])

In [8]:
print(counts)

0     23
1    434
2     12
3     45
dtype: int64

In [4]:
print(counts.values)
print(counts.index)

[ 23 434  12  45]
RangeIndex(start=0, stop=4, step=1)

In [5]:
counts = pd.Series([23,43,12],index=['A','B','C'])

In [6]:
counts

A    23
B    43
C    12
dtype: int64

In [8]:
counts = pd.Series([23,43,12,45],index=['Atest','Btest','Ctest','D'])

In [9]:
counts[counts.index.str.endswith('test')]

Atest    23
Btest    43
Ctest    12
dtype: int64

In [14]:
'Btest' in counts

True

In [10]:
counts[2]

12

In [16]:
counts.name = 'TestName'
counts.index.name = 'Marks'
counts

Marks
Atest    23
Btest    43
Ctest    12
D        45
Name: TestName, dtype: int64

In [3]:
import numpy as np

In [18]:
np.log(counts)

Marks
Atest    3.135494
Btest    3.761200
Ctest    2.484907
D        3.806662
Name: TestName, dtype: float64

In [19]:
counts[counts>23]

Marks
Btest    43
D        45
Name: TestName, dtype: int64

In [13]:
bact = pd.Series({'bact_A':122,'bact_B':132,'bact_C':102,'bact_D':112})
print(bact)

bact_A    122
bact_B    132
bact_C    102
bact_D    112
dtype: int64

In [14]:
bact_1 = pd.Series(bact,
                  index = ['bact_A','bact_B','bact_C','bact_E'])
print(bact_1)

bact_A    122.0
bact_B    132.0
bact_C    102.0
bact_E      NaN
dtype: float64

In [16]:
bact_1.isnull()
bact_1.isna()

bact_A    False
bact_B    False
bact_C    False
bact_E     True
dtype: bool

In [26]:
bact+bact_1
#Union(add)

bact_A    244.0
bact_B    264.0
bact_C    204.0
bact_D      NaN
bact_E      NaN
dtype: float64

In [11]:
bact_df = pd.DataFrame({'value':[632, 1638, 569, 115, 433, 1130, 754, 555],
                     'patient':[1, 1, 1, 1, 2, 2, 2, 2],
                     'phylum':['Firmicutes', 'Proteobacteria', 'Actinobacteria', 
    'Bacteroidetes', 'Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes']})
print(bact_df)

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

In [13]:
bact_df[['patient','value','phylum']]
print(bact_df)

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

In [12]:
bact_df.columns

Index(['value', 'patient', 'phylum'], dtype='object')

In [14]:
bact_df.value #as a Series

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: value, dtype: int64

In [15]:
bact_df[['value']] #as a dataframe

   value
0    632
1   1638
2    569
3    115
4    433
5   1130
6    754
7    555

In [16]:
bact_df.loc[3]

value                115
patient                1
phylum     Bacteroidetes
Name: 3, dtype: object

In [17]:
bact_df.head()

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes

In [18]:
bact_df.tail(3)

   value  patient          phylum
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

In [19]:
bact_df.shape

(8, 3)

In [18]:
bacteria_data = pd.DataFrame([{'patient': 1, 'phylum': 'Firmicutes', 'value': 632},
                    {'patient': 1, 'phylum': 'Proteobacteria', 'value': 1638},
                    {'patient': 1, 'phylum': 'Actinobacteria', 'value': 569},
                    {'patient': 1, 'phylum': 'Bacteroidetes', 'value': 115},
                    {'patient': 2, 'phylum': 'Firmicutes', 'value': 433},
                    {'patient': 2, 'phylum': 'Proteobacteria', 'value': 1130},
                    {'patient': 2, 'phylum': 'Actinobacteria', 'value': 754},
                    {'patient': 2, 'phylum': 'Bacteroidetes', 'value': 555}])

In [22]:
bacteria_data

   patient          phylum  value
0        1      Firmicutes    632
1        1  Proteobacteria   1638
2        1  Actinobacteria    569
3        1   Bacteroidetes    115
4        2      Firmicutes    433
5        2  Proteobacteria   1130
6        2  Actinobacteria    754
7        2   Bacteroidetes    555

In [23]:
vals = bacteria_data.value
vals

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: value, dtype: int64

In [24]:
vals[5] = 0 #modify

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [25]:
vals

0     632
1    1638
2     569
3     115
4     433
5       0
6     754
7     555
Name: value, dtype: int64

In [26]:
bacteria_data #value of vals[5] changed here as well

   patient          phylum  value
0        1      Firmicutes    632
1        1  Proteobacteria   1638
2        1  Actinobacteria    569
3        1   Bacteroidetes    115
4        2      Firmicutes    433
5        2  Proteobacteria      0
6        2  Actinobacteria    754
7        2   Bacteroidetes    555

In [19]:
vals = bacteria_data['value'].copy()
vals[5] = 1000 #changing the value from 0 to 1000
vals #changed

0     632
1    1638
2     569
3     115
4     433
5    1000
6     754
7     555
Name: value, dtype: int64

In [20]:
bacteria_data #not changed

   patient          phylum  value
0        1      Firmicutes    632
1        1  Proteobacteria   1638
2        1  Actinobacteria    569
3        1   Bacteroidetes    115
4        2      Firmicutes    433
5        2  Proteobacteria   1130
6        2  Actinobacteria    754
7        2   Bacteroidetes    555

In [31]:
bacteria_data.value[5] = 1130

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [32]:
bacteria_data['year'] = 2013

In [33]:
bacteria_data

   patient          phylum  value  year
0        1      Firmicutes    632  2013
1        1  Proteobacteria   1638  2013
2        1  Actinobacteria    569  2013
3        1   Bacteroidetes    115  2013
4        2      Firmicutes    433  2013
5        2  Proteobacteria   1130  2013
6        2  Actinobacteria    754  2013
7        2   Bacteroidetes    555  2013

In [36]:
treatment = pd.Series([0]*4+[1]*2)
treatment

bacteria_data['treatment'] = treatment
bacteria_data

   patient          phylum  value  year  treatment
0        1      Firmicutes    632  2013        0.0
1        1  Proteobacteria   1638  2013        0.0
2        1  Actinobacteria    569  2013        0.0
3        1   Bacteroidetes    115  2013        0.0
4        2      Firmicutes    433  2013        1.0
5        2  Proteobacteria   1130  2013        1.0
6        2  Actinobacteria    754  2013        NaN
7        2   Bacteroidetes    555  2013        NaN

In [38]:
months = ['Jan','Feb','Mar']
bacteria_data['month'] = months
bacteria_data

ValueError: Length of values does not match length of index

In [43]:
bacteria_data['month'] = ['Jan']*len(bacteria_data)
bacteria_data

   patient          phylum  value  year  treatment month
0        1      Firmicutes    632  2013        0.0   Jan
1        1  Proteobacteria   1638  2013        0.0   Jan
2        1  Actinobacteria    569  2013        0.0   Jan
3        1   Bacteroidetes    115  2013        0.0   Jan
4        2      Firmicutes    433  2013        1.0   Jan
5        2  Proteobacteria   1130  2013        1.0   Jan
6        2  Actinobacteria    754  2013        NaN   Jan
7        2   Bacteroidetes    555  2013        NaN   Jan

In [53]:
#del bacteria_data['month']
#bacteria_data.drop('treatment',axis=1)
del bacteria_data['treatment']
bacteria_data

   patient          phylum  value  year
0        1      Firmicutes    632  2013
1        1  Proteobacteria   1638  2013
2        1  Actinobacteria    569  2013
3        1   Bacteroidetes    115  2013
4        2      Firmicutes    433  2013
5        2  Proteobacteria   1130  2013
6        2  Actinobacteria    754  2013
7        2   Bacteroidetes    555  2013

In [55]:
bacteria_data.values

array([[1, 'Firmicutes', 632, 2013],
       [1, 'Proteobacteria', 1638, 2013],
       [1, 'Actinobacteria', 569, 2013],
       [1, 'Bacteroidetes', 115, 2013],
       [2, 'Firmicutes', 433, 2013],
       [2, 'Proteobacteria', 1130, 2013],
       [2, 'Actinobacteria', 754, 2013],
       [2, 'Bacteroidetes', 555, 2013]], dtype=object)

In [56]:
df = pd.DataFrame({'foo':[1,2,3],'bat':[1.1,-2.2,3.3]})
df.values, df.shape

(array([[ 1. ,  1.1],
        [ 2. , -2.2],
        [ 3. ,  3.3]]), (3, 2))

In [58]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [59]:
bacteria_data.index

RangeIndex(start=0, stop=8, step=1)

In [60]:
bacteria_data.index[0]=15 #error

TypeError: Index does not support mutable operations

In [70]:
bd.index = bacteria_data.index

In [71]:
bd

0        Firmicutes
1    Proteobacteria
2    Actinobacteria
3     Bacteroidetes
4        Firmicutes
5    Proteobacteria
6    Actinobacteria
7     Bacteroidetes
Name: phylum, dtype: object

In [72]:
!head ../data/olympics.1996.txt

Tonga	1	96165
Bahamas	1	281584
Jamaica	6	2589043
Cuba	25	10952046
Australia	41	18348078
Hungary	21	10273590
Bulgaria	15	8181047
Trinidad & Tobago	2	1196910
New Zealand	6	3621200
Norway	7	4381275

In [76]:
medals = pd.read_table('../data/olympics.1996.txt', sep = '\t', index_col = 0,
                       header = None, names = ['Country','Medals','Population'])
medals.head()

           Medals  Population
Country
Tonga           1       96165
Bahamas         1      281584
Jamaica         6     2589043
Cuba           25    10952046
Australia      41    18348078

In [23]:
oced_web = pd.read_html('https://en.wikipedia.org/wiki/List_of_S%26P_500_companies')
oced_web
oced_web = None

In [30]:
#pd.read_csv('../data/microbiome/microbiome.csv', skiprows=[2,4,6]).head()
nb = pd.read_csv('../data/microbiome/microbiome.csv', index_col = ['Taxon','Patient'])
nb

                    Tissue  Stool
Taxon      Patient
Firmicutes 1           632    305
           2           136   4182
           3          1174    703
           4           408   3946
           5           831   8605
...                    ...    ...
Other      11          203      6
           12          392      6
           13           28     25
           14           12     22
           15          305     32

[75 rows x 2 columns]

In [31]:
nb.index #multiindex

MultiIndex([(    'Firmicutes',  1),
            (    'Firmicutes',  2),
            (    'Firmicutes',  3),
            (    'Firmicutes',  4),
            (    'Firmicutes',  5),
            (    'Firmicutes',  6),
            (    'Firmicutes',  7),
            (    'Firmicutes',  8),
            (    'Firmicutes',  9),
            (    'Firmicutes', 10),
            (    'Firmicutes', 11),
            (    'Firmicutes', 12),
            (    'Firmicutes', 13),
            (    'Firmicutes', 14),
            (    'Firmicutes', 15),
            ('Proteobacteria',  1),
            ('Proteobacteria',  2),
            ('Proteobacteria',  3),
            ('Proteobacteria',  4),
            ('Proteobacteria',  5),
            ('Proteobacteria',  6),
            ('Proteobacteria',  7),
            ('Proteobacteria',  8),
            ('Proteobacteria',  9),
            ('Proteobacteria', 10),
            ('Proteobacteria', 11),
            ('Proteobacteria', 12),
            ('Proteobacteria', 13),
            ('Proteobacteria', 14),
            ('Proteobacteria', 15),
            ('Actinobacteria',  1),
            ('Actinobacteria',  2),
            ('Actinobacteria',  3),
            ('Actinobacteria',  4),
            ('Actinobacteria',  5),
            ('Actinobacteria',  6),
            ('Actinobacteria',  7),
            ('Actinobacteria',  8),
            ('Actinobacteria',  9),
            ('Actinobacteria', 10),
            ('Actinobacteria', 11),
            ('Actinobacteria', 12),
            ('Actinobacteria', 13),
            ('Actinobacteria', 14),
            ('Actinobacteria', 15),
            ( 'Bacteroidetes',  1),
            ( 'Bacteroidetes',  2),
            ( 'Bacteroidetes',  3),
            ( 'Bacteroidetes',  4),
            ( 'Bacteroidetes',  5),
            ( 'Bacteroidetes',  6),
            ( 'Bacteroidetes',  7),
            ( 'Bacteroidetes',  8),
            ( 'Bacteroidetes',  9),
            ( 'Bacteroidetes', 10),
            ( 'Bacteroidetes', 11),
            ( 'Bacteroidetes', 12),
            ( 'Bacteroidetes', 13),
            ( 'Bacteroidetes', 14),
            ( 'Bacteroidetes', 15),
            (         'Other',  1),
            (         'Other',  2),
            (         'Other',  3),
            (         'Other',  4),
            (         'Other',  5),
            (         'Other',  6),
            (         'Other',  7),
            (         'Other',  8),
            (         'Other',  9),
            (         'Other', 10),
            (         'Other', 11),
            (         'Other', 12),
            (         'Other', 13),
            (         'Other', 14),
            (         'Other', 15)],
           names=['Taxon', 'Patient'])

In [32]:
nb.loc['Firmicutes',3] #multiindex

Tissue    1174
Stool      703
Name: (Firmicutes, 3), dtype: int64

In [33]:
nb.loc['Firmicutes']

         Tissue  Stool
Patient
1           632    305
2           136   4182
3          1174    703
4           408   3946
5           831   8605
6           693     50
7           718    717
8           173     33
9           228     80
10          162   3196
11          372     32
12         4255   4361
13          107   1667
14           96    223
15          281   2377

In [87]:
pd.read_csv('../data/microbiome/microbiome.csv', nrows=8)

        Taxon  Patient  Tissue  Stool
0  Firmicutes        1     632    305
1  Firmicutes        2     136   4182
2  Firmicutes        3    1174    703
3  Firmicutes        4     408   3946
4  Firmicutes        5     831   8605
5  Firmicutes        6     693     50
6  Firmicutes        7     718    717
7  Firmicutes        8     173     33

In [ ]:
chunks = pd.read_csv('../data/microbiome/microbiome.csv', chunksize=20)

In [ ]:
next(chunk)

In [24]:
import sqlite3

query = '''
CREATE TABLE samples
(taxon VARCHAR(15), patient INTEGER, tissue INTEGER, stool INTEGER);
'''

In [25]:
con = sqlite3.connect('microbiome.sqlite3')
con.execute(query)
con.commit()

OperationalError: table samples already exists

In [ ]:
query_input = "insert into samples values('a',1,123,3443)"
con.execute(query_input)
con.commit()

In [29]:
cursor = con.execute('select * from samples')
rows = cursor.fetchall()
rows

[('a', 1, 123, 3443)]

In [35]:
pd.DataFrame(rows, columns=['taxon','patient','tissue','stool'])

  taxon  patient  tissue  stool
0     a        1     123   3443

In [36]:
table_info = con.execute('PRAGMA table_info(samples);').fetchall()
table_info

[(0, 'taxon', 'VARCHAR(15)', 0, None, 0),
 (1, 'patient', 'INTEGER', 0, None, 0),
 (2, 'tissue', 'INTEGER', 0, None, 0),
 (3, 'stool', 'INTEGER', 0, None, 0)]

In [37]:
pd.read_sql_query('select * from samples',con)

  taxon  patient  tissue  stool
0     a        1     123   3443

In [38]:
rows_to_append = pd.read_csv('../data/microbiome/microbiome_missing.csv').head(10)
rows_to_append

        Taxon  Patient Tissue   Stool
0  Firmicutes        1    632   305.0
1  Firmicutes        2    136  4182.0
2  Firmicutes        3    NaN   703.0
3  Firmicutes        4    408  3946.0
4  Firmicutes        5    831  8605.0
5  Firmicutes        6    693    50.0
6  Firmicutes        7    718   717.0
7  Firmicutes        8    173    33.0
8  Firmicutes        9    228     NaN
9  Firmicutes       10    162  3196.0

In [40]:
rows_to_append.to_sql('samples', con, if_exists='append', index=False)

In [46]:
pd.read_sql_query('select * from samples',con)

         taxon  patient  tissue   stool
0            a        1   123.0  3443.0
1   Firmicutes        1   632.0   305.0
2   Firmicutes        2   136.0  4182.0
3   Firmicutes        3     NaN   703.0
4   Firmicutes        4   408.0  3946.0
5   Firmicutes        5   831.0  8605.0
6   Firmicutes        6   693.0    50.0
7   Firmicutes        7   718.0   717.0
8   Firmicutes        8   173.0    33.0
9   Firmicutes        9   228.0     NaN
10  Firmicutes       10   162.0  3196.0

In [47]:
# Get rid of the database we created
!rm microbiome.sqlite3

rm: microbiome.sqlite3: No such file or directory

In [48]:
ebola_dir = !ls ../data/ebola
ebola_dir

['LICENSE', 'guinea_data', 'liberia_data', 'sl_data']